"ALL_DAY_DAY_VIEW" = "all-day";
"NOON" = "Noon";
"UNTITLED_EVENT" = "New Event";
"ALL_DAY" = "all-day";
"ALL_DAY_EVENTS" = "all-day events";
"CELL_ENDS" = "ENDS";

"CALENDARS" = "Calendars";

"ALL" = "All";
"ALL_CALENDARS" = "All Calendars";
"ALL_OF_STORE" = "All %@";
"N_CALENDARS" = "%@ Calendars";

"SHOW_CALENDARS" = "Show Calendars";
"SHOW_ALL_CALENDARS" = "Show All Calendars";
"HIDE_ALL_CALENDARS" = "Hide All Calendars";
"NO_CALENDARS" = "No Calendars";

"ALERT" = "Alert";
"ALERT_LOWERCASE" = "alert";
"ALERT_DETAIL_NAV_TITLE" = "Event Alert";
"SECOND_ALERT" = "Second Alert";
"NONE_ALERT" = "None";
"NONE_INVITEES" = "None";
"EVENT" = "Event";
"EVENTS" = "Events";

"INTERVAL_SEPARATOR" = ", ";
"INTERVAL_DAYS" = "%@ days";
"INTERVAL_DAY" = "1 day";
"INTERVAL_HOURS" = "%@ hours";
"INTERVAL_HOUR" = "1 hour";
"INTERVAL_MINUTES" = "%@ minutes";
"INTERVAL_MINUTE" = "1 minute";
"INTERVAL_SECONDS" = "%@ seconds";
"INTERVAL_SECOND" = "1 second";
"INTERVAL_WEEK" = "1 week";
"INTERVAL_FORMAT_BEFORE" = "%@ before";
"INTERVAL_FORMAT_AFTER" = "%@ after";
"BEFORE" = " before";
"AFTER" = " after";
"ON_TIME" = "At time of event";
"ON_TIME_AT" = "On day of event (%@)";
"ALL_DAY_ALARM_FORMAT" = "%@ (%@)";


"DAY_TO_BETWEEN_TIMES" = " to ";
"DAY_TO_NO_START_OR_LINE_BEGINNING" = "to ";

"DAY_HEADER_WEEKDAY_WITH_DATE_MONTH_YEAR_FORMAT" = "%1$@, %2$@";

"DETAIL_ALL_DAY" = "All day";

"DETAIL_DURATION_FORMAT" = "from %@ to %@";
"DETAIL_MULTIPLE_DAYS_START_FORMAT" = "from %@ %@";
"DETAIL_DURATION_FORMAT_NO_FROM" = "%@ to %@";
"DETAIL_MULTIPLE_DAYS_END_FORMAT" = "to %@ %@";
"DETAIL_MULTIPLE_ALL_DAY_START_FORMAT" = "All day from %@";
"DETAIL_MULTIPLE_ALL_DAY_END_FORMAT" = "to %@";

"CALENDAR" = "Calendar";
"UNTITLED_CALENDAR" = "Untitled Calendar";
"UNTITLED_ACCOUNT" = "Untitled Account";

"NOTES_PLACEHOLDER" = "Notes";
"NOTES_LOWERCASE" = "notes";
"NOTES" = "Notes";
"SHOW_ALL_NOTES" = "Show All Notes";

"URL" = "URL";
"URL_LOWERCASE" = "url";

"VIEW_ON_FACEBOOK" = "View on Facebook";

"UNKNOWN" = "Unknown";

"SHARED_CALENDAR" = "Shared Calendar";
"SHARED" = "Shared";
"SHARED_BY_WITH_OWNER_DESCRIPTION" = "Shared by %@";
"SHARED_WITH_SINGLE_PERSON" = "Shared with %@";
"SHARED_WITH_MULTIPLE_PEOPLE" = "Shared with %@ and…";
"PUBLIC_AND_SHARED" = "Public and Shared with %@…";

"ACCESS_DENIED_EVENTS" = "This app does not have access to your calendars.";
"ACCESS_DENIED_REMINDERS" = "This app does not have access to your reminders.";

/* Name of subscribed group */
"SUBSCRIBED" = "Subscribed";
/* Name of birthday calendar */
"BIRTHDAY_CALENDAR" = "Birthdays";
/* The 'other' account, where the birthday calendar lives */
"OTHER_ACCOUNT" = "Other";

/* Name of default Reminders calendar (9806767) */
"REMINDERS_CALENDAR" = "Reminders";

/* Names of default iCloud calendars */
"ICLOUD_HOME_CALENDAR" = "Home";
"ICLOUD_WORK_CALENDAR" = "Work";

"STARTS" = "Starts";
"ENDS" = "Ends";

"REPEAT" = "Repeat";
"NEVER" = "Never";
"DAILY" = "Daily";
"WEEKLY" = "Weekly";
"BIWEEKLY" = "Biweekly";
"MONTHLY" = "Monthly";
"YEARLY" = "Yearly";
"CUSTOM" = "Custom";

"AVAILABILITY" = "Availability";
"BUSY" = "Busy";
"FREE" = "Free";
"TENTATIVE" = "Tentative";
"OUT_OF_OFFICE" = "Out of office";

"EDIT" = "Edit";
"CANCEL" = "Cancel";
"DONE" = "Done";
"ADD" = "Add";
"TO_WITH_COLON" = "To:";

/* ICS preview controller strings */

/* titles */
"ICS_EVENT_DETAILS" = "Event Details";
"ICS_EVENTS" = "%@ Events";

/* button title */
"ICS_ADD_ALL" = "Add All";
"ICS_ADD_SOME" = "Add (%@)";

/* calendar chooser title */
"ICS_CHOOSE_CALENDAR" = "Choose Calendar";

"DELETE_CALENDAR" = "Delete Calendar";
"EDIT_CALENDAR" = "Edit Calendar";
"EDIT_CALENDARS" = "Edit Calendars";
"ADD_CALENDAR" = "Add Calendar";
"JOIN_CALENDAR" = "Join Calendar";
"CALENDAR_NAME" = "Calendar Name";
"NEW_CALENDAR_WITH_ELLIPSIS" = "New Calendar…";
"ADD_CALENDAR_WITH_ELLIPSIS" = "Add Calendar…";
"DELETE_CALENDAR_CONFIRMATION" = "Are you sure you want to delete this calendar? All events and reminders associated with the calendar will also be deleted.";
"DELETE_CALENDAR_CONFIRMATION_EVENTS_ONLY" = "Are you sure you want to delete this calendar? All events associated with the calendar will also be deleted.";
"DELETE_CALENDAR_CONFIRMATION_REMINDERS_ONLY" = "Are you sure you want to delete this calendar? All reminders associated with the calendar will also be deleted.";

"UNKNOWN_IDENTITY" = "somebody";
"UNKNOWN_IDENTITY_CAPITALIZED" = "Somebody";

"JOIN_CALENDAR_TITLE_FORMAT" = "Join “%@”?";
"JOIN_CALENDAR_BODY_FORMAT" = "%@ invited you to a shared calendar.";

"CANCELELD_BY_FORMAT" = "Canceled by %@";
"FROM_FORMAT" = "From: %@";
"TIME_CHANGED_TO_FORMAT" = "Time changed to %@";
"DATE_CHANGED_TO_FORMAT" = "Date changed to %@";
"LOCATION_CHANGED" = "Location changed";

"QUOTED_FORMAT" = "“%@”";

"COLOR" = "Color";
"PURPLE" = "Purple";
"ORANGE" = "Orange";
"BLUE" = "Blue";
"RED" = "Red";
"BROWN" = "Brown";
"YELLOW" = "Yellow";
"GREEN" = "Green";

"SHARED_WITH_COLON" = "Shared with:";
"PENDING" = "Pending";
"OWNER" = "Owner";
"ADD_PERSON" = "Add Person";
"ADD_PERSON_WITH_ELLIPSIS" = "Add Person…";
"PUBLIC_CALENDAR" = "Public Calendar";
"PUBLIC_CALENDAR_DESCRIPTION" = "Allow anyone to subscribe to a read-only version of this calendar.";
"PUBLISHING_WITH_ELLIPSIS" = "Publishing…";
"VIEW_ONLY" = "View Only";
"VIEW_AND_EDIT" = "View & Edit";
"ALLOW_EDITING" = "Allow Editing";
"ALLOW_EDITING_DESCRIPTION" = "Allow this person to make changes to\nthe calendar.";
"RESEND_SHARING_INVITATION" = "Resend Sharing Invitation";
"REMOVE_FROM_CALENDAR" = "Remove from Calendar";
"REMOVE" = "Remove";
"REMOVE_ALERT_TEXT" = "%@ will immediately lose access to this calendar.";
"SHARE_LINK_WITH_ELLIPSIS" = "Share Link…";
"SHARE_LINK_TO_CALENDAR_WITH" = "Share link to calendar with:";
"EMAIL" = "Email";
"MESSAGE" = "Message";
"TWEET" = "Tweet";
"COPY_LINK" = "Copy Link";

/* Shared calendar event changes */
"SHARED_ADDED_TO_CALENDAR_BY" = "Added to %@ by %@";
"SHARED_DELETED_FROM_CALENDAR_BY" = "Deleted from %@ by %@";
"SHARED_UPDATED_IN_CALENDAR_BY" = "Updated in %@ by %@";
"SHARED_ONE_PROP_CHANGED_BY" = "%@ changed by %@";
"SHARED_ONE_PROP_CHANGED_TO_BY" = "%@ changed to %@ by %@";
"SHARED_TWO_PROPS_CHANGED_BY" = "%@ and %@ changed by %@";

"SHARED_ADDED_TO_CALENDAR_COALESCED" = "%@ events were added to %@.";
"SHARED_DELETED_FROM_CALENDAR_COALESCED" = "%@ events were deleted from %@.";
"SHARED_UPDATED_IN_CALENDAR_COALESCED" = "%@ events were updated in %@.";
"SHARED_ADDED_TO_CALENDAR_BY_COALESCED" = "%@ events were added to %@ by %@.";
"SHARED_DELETED_FROM_CALENDAR_BY_COALESCED" = "%@ events were deleted from %@ by %@.";
"SHARED_UPDATED_IN_CALENDAR_BY_COALESCED" = "%@ events were updated in %@ by %@.";

"SHARED_PROP_DATE" = "date";
"SHARED_PROP_TIME" = "time";
"SHARED_PROP_TITLE" = "title";
"SHARED_PROP_LOCATION" = "location";

"ADD_SHAREES_PROMPT" = "Add participants to this Calendar.";

"CREATED_BY" = "Created by";
"EDITED_BY" = "Edited by";
"CREATED_BY_LOWERCASE" = "created by";
"EDITED_BY_LOWERCASE" = "edited by";

"SHARED_CALENDAR_INVITE_REPLY_ACCEPTED" = "%@ joined your shared calendar.";
"SHARED_CALENDAR_INVITE_REPLY_DECLINED" = "%@ declined your shared calendar.";
"PENDING_SHARED_CALENDAR_FORMAT" = "%@ is pending on this shared calendar invitation.";

"SHARED_CALENDAR_NO_LONGER_SHARED" = "This calendar is no longer shared.";
"SHARED_CALENDAR_NOW_PUBLIC" = "This calendar is now public.";

"PUBLISHED_CALENDAR_MESSAGE_SUBJECT" = "Subscribe to my %@ Calendar";
"PUBLISHED_CALENDAR_MESSAGE_BODY" = "Subscribe to my %@ Calendar at: %@";

"ATTACHMENTS" = "Attachments";
"ATTACHMENTS_LOWERCASE" = "attachments";
"CANNOT_OPEN_ATTACHMENT" = "Cannot Open Attachment";
"ATTACHMENT_DOWNLOAD_PROGRESS" = "%@ of %@";
"ATTACHMENT_DOWNLOAD_ERROR" = "An error occurred while downloading the attachment.";
"ATTACHMENT_FILE_TYPE_ERROR" = "This type of file is not supported.";
"UNTITLED_ATTACHMENT" = "Untitled Attachment";

"UPDATING_CALENDARS_WITH_ELLIPSIS" = "Updating Calendars…";

"ENDS_TIME_FORMAT" = "ends %@";

"CALENDAR_DATE_AT_TIME_FORMAT" = "%@ at %@";
"CALENDAR_TODAY" = "Today";
"CALENDAR_TODAY_LOWER" = "today";
"CALENDAR_YESTERDAY" = "Yesterday";
"CALENDAR_YESTERDAY_LOWER" = "yesterday";
"CALENDAR_TOMORROW" = "Tomorrow";
"CALENDAR_TOMORROW_LOWER" = "tomorrow";

/* date prior to day, but in previous week ('last Monday')*/
"CALENDAR_LAST_WEEK_FORMAT" = "Last %@";
"CALENDAR_LAST_WEEK_LOWER_FORMAT" = "last %@";
/* prior day to today, but in this week ('this past Monday') */
"CALENDAR_PRIOR_DAY_THIS_WEEK_FORMAT" = "Last %@";
"CALENDAR_PRIOR_DAY_THIS_WEEK_LOWER_FORMAT" = "last %@";
/* date after today, but in this week ('this Friday') */
"CALENDAR_SUBSEQUENT_DAY_THIS_WEEK_FORMAT" = "This %@";
"CALENDAR_SUBSEQUENT_DAY_THIS_WEEK_LOWER_FORMAT" = "this %@";
/* date after today, but in next week ('next Thursday'). I'm not completely sure why we don't just say Next here. */
"CALENDAR_NEXT_WEEK_FORMAT" = "This %@";
"CALENDAR_NEXT_WEEK_LOWER_FORMAT" = "this %@";

/* These strings are used for the title of a group of accounts of specific types */
"SUBSCRIBED_CALENDAR_GROUP_TITLE" = "Subscribed";
/* Ususally preceeded by "All" to denote selecting all the calendars in the group. In english these are the same. */
"SUBSCRIBED_CALENDAR_GROUP_MID_SENTENCE_TITLE" = "Subscribed";

"FACEBOOK_GROUP_TITLE" = "Facebook";
"FACEBOOK_GROUP_MID_SENTENCE_TITLE" = "Facebook";
